       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVISION-BY-ZERO.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMERATOR PIC 9(5) VALUE 100.
       01 WS-DENOMINATOR PIC 9(5) VALUE 0.
       01 WS-RESULT PIC 9(5).
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           COMPUTE WS-RESULT = WS-NUMERATOR / WS-DENOMINATOR.
           DISPLAY "RESULT: " WS-RESULT.
           STOP RUN.
