       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVALID-LEVEL.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       1 WS-VAR PIC X(10).
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "INVALID LEVEL".
           STOP RUN.
