       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVALID-OCCURS.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TABLE.
           05 WS-NUMBER PIC 9(3) OCCURS -5 TIMES.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "INVALID OCCURS".
           STOP RUN.
