       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISMATCHED-PARENTHESIS.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM PIC 9(5 VALUE 100.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY WS-NUM.
           STOP RUN.
