       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSING-PROGRAM-ID.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-VAR PIC X(10).
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "NO PROGRAM ID".
           STOP RUN.
