       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSING-PERIOD.
       
       DATA DIVISION
       WORKING-STORAGE SECTION.
       01 WS-VAR PIC X(10).
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "MISSING PERIOD".
           STOP RUN.
