       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSING-SECTION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-VAR PIC X(10).
       
       MAIN-PROCEDURE.
           DISPLAY "MISSING PROCEDURE DIVISION".
           STOP RUN.
