       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNDECLARED-VAR.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DEFINED PIC X(10).
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           MOVE "HELLO" TO WS-UNDEFINED.
           DISPLAY WS-UNDEFINED.
           STOP RUN.
