        IDENTIFICATION DIVISION.
        PROGRAM-ID. ACCEPT-DATE-TIME-TEST.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01  WS-DATE-VAL    PIC X(6).
        01  WS-TIME-VAL    PIC X(6).
        PROCEDURE DIVISION.
        MAIN-PROCEDURE.
            ACCEPT WS-DATE-VAL FROM DATE.
            ACCEPT WS-TIME-VAL FROM TIME.
            DISPLAY "DATE: " WS-DATE-VAL.
            DISPLAY "TIME: " WS-TIME-VAL.
            STOP RUN.
