       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. TESTER.
       
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GREETING PIC X(13) VALUE "HELLO WORLD!".
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY WS-GREETING.
           STOP RUN.
