IDENTIFICATION DIVISION.
PROGRAM-ID. TEST-PICTURE-VALUE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-NAME    PIC X(10) VALUE SPACE.
01  WS-ZERO    PIC 9(5) VALUE ZEROS.
01  WS-Z       PIC X(5) VALUE ZEROS.
PROCEDURE DIVISION.
    DISPLAY "SPACE: [" WS-NAME "]".
    DISPLAY "ZEROS: [" WS-ZERO "]".
    DISPLAY "X ZEROS: [" WS-Z "]".
    STOP RUN.