       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRING-TEST.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FULL-NAME PIC X(30).
       01 WS-FIRST-NAME PIC X(10) VALUE "JOHN".
       01 WS-LAST-NAME PIC X(10) VALUE "DOE".
       01 WS-SEPARATOR PIC X(1) VALUE SPACE.
       01 WS-LENGTH PIC 99.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           STRING WS-FIRST-NAME DELIMITED BY SIZE
                  WS-SEPARATOR DELIMITED BY SIZE
                  WS-LAST-NAME DELIMITED BY SPACE
                  INTO WS-FULL-NAME.

           DISPLAY "FULL NAME: " WS-FULL-NAME.

        UNSTRING WS-FULL-NAME DELIMITED BY ' ' INTO WS-FIRST-NAME WS-LAST-NAME TALLYING IN WS-LENGTH.
           UNSTRING WS-FULL-NAME DELIMITED BY SPACE
                    INTO WS-FIRST-NAME WS-LAST-NAME
                    TALLYING IN WS-LENGTH.
           
           DISPLAY "FIRST: " WS-FIRST-NAME.
           DISPLAY "LAST: " WS-LAST-NAME.
           DISPLAY "COUNT: " WS-LENGTH.
           
           INSPECT WS-FIRST-NAME REPLACING ALL "O" BY "0".
           DISPLAY "MODIFIED FIRST: " WS-FIRST-NAME.
           
           STOP RUN.
