IDENTIFICATION DIVISION.
PROGRAM-ID. STRING-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-STR PIC X(10) VALUE "HELLOWORLD".
01  WS-DEST PIC X(20).
PROCEDURE DIVISION.
    STRING WS-STR DELIMITED BY SIZE
        INTO WS-DEST.
    DISPLAY WS-DEST.
    STOP RUN.